In [4]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Pandas 
Pandas in a Python Library used for data manipulation and analysis. Pandas provides a convenient way to analyze and clean data.

Pandas works on relationed datasets.

## What is Pandas Used for?
- Data Cleaning
- Data Transformation
- Data Analysis
- Machine Learning
- Data Visualization

## Why Use Pandas?
- **Handle Large Data Efficently**: Pandas is designed for handling large datasets. It provides powerful tools that simplify tasks like data filtering, transforming, and merging. 
It also provides built-in functions to work with formats lik**e CSV, JSON, TXT, Excel, a SQL** databases
- **Tabular Data Representation**:
- **Data Cleaning and Preprocessing**
- **Time Series Functionality**
- **Free and Open-Source**s.

## Datatypes of Pandas
1. **DataFrame**: 2D table with rows and columns
2. **Series**: 1D array-like,can hold any datatype such as integers stirngs, floating point number.

In [5]:
# Importing datasets using pandas
data = pd.read_csv("C:\\Users\\Prabin\\Demographic-Data.csv")

In [6]:
# KNowing the length of dataset
len(data)

195

In [7]:
# Knowing Heading of datasets
data.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [10]:
# Knowing/seeing column names:
data.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [14]:
#Renaming the column name
data.columns = ['Country_Naam', 'Country_Code', 'Birth_Rate', 'Internet_Users',
       'Income_Group']
print(data.columns)

Index(['Country_Naam', 'Country_Code', 'Birth_Rate', 'Internet_Users',
       'Income_Group'],
      dtype='object')

In [15]:
# Renaming soecific column name:
data.rename(columns={"Country_Naam":"Country_Name"}, inplace=True)
print(data.columns)

Index(['Country_Name', 'Country_Code', 'Birth_Rate', 'Internet_Users',
       'Income_Group'],
      dtype='object')

In [16]:
# How to see the bottom only 
data.tail()

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [17]:
# Getting information about the dataframe.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country_Name    195 non-null    object
 1   Country_Code    195 non-null    object
 2   Birth_Rate      195 non-null    float64
 3   Internet_Users  195 non-null    float64
 4   Income_Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [18]:
# Getting all small details of data
description = data.describe()

In [19]:
description.transpose

<bound method DataFrame.transpose of        Birth_Rate  Internet_Users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800>

### Acessing datas (Subsetting in pandas)
There are three ways of subsetting dataframes. They are:
1. Subset by Rows
2. Subset by Columns
3. Combining both

#### Subsetting with rows:

In [20]:
data.head()

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [27]:
data[0: 20: 2] # Index 0 is 1st country dekhi 20th country samma difference of 2.

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
0,Aruba,ABW,10.244,78.9000,High income
2,Angola,AGO,45.985,19.1000,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0000,High income
6,Armenia,ARM,13.308,41.9000,Lower middle income
8,Australia,AUS,13.200,83.0000,High income
10,Azerbaijan,AZE,18.300,58.7000,Upper middle income
12,Belgium,BEL,11.200,82.1702,High income
14,Burkina Faso,BFA,40.551,9.1000,Low income
16,Bulgaria,BGR,9.200,53.0615,Upper middle income
18,"Bahamas, The",BHS,15.339,72.0000,High income

In [29]:
data[::-1].head() # Reversing all the dataframe

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
194,Zimbabwe,ZWE,35.715,18.5,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
191,South Africa,ZAF,20.850,46.5,Upper middle income
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income

In [35]:
data[185: 195].head()

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
185,Virgin Islands (U.S.),VIR,10.700,45.3,High income
186,Vietnam,VNM,15.537,43.9,Lower middle income
187,Vanuatu,VUT,26.739,11.3,Lower middle income
188,West Bank and Gaza,PSE,30.394,46.6,Lower middle income
189,Samoa,WSM,26.172,15.3,Lower middle income

<br>

#### Subsetting through column

In [37]:
data["Birth_Rate"].head()

0    10.244
1    35.253
2    45.985
3    12.877
4    11.044
Name: Birth_Rate, dtype: float64

In [39]:
data[["Birth_Rate", "Income_Group"]].head()

   Birth_Rate         Income_Group
0      10.244          High income
1      35.253           Low income
2      45.985  Upper middle income
3      12.877  Upper middle income
4      11.044          High income

In [41]:
data.Birth_Rate  #Quick Access method of subsetting for one columns

0      10.244
1      35.253
2      45.985
3      12.877
4      11.044
        ...
190    32.947
191    20.850
192    42.394
193    40.471
194    35.715
Name: Birth_Rate, Length: 195, dtype: float64

<br>

#### Combining both
It is combining both subtting with row and subsetting with columns

In [48]:
data[0:21:2][["Birth_Rate", "Internet_Users"]]

    Birth_Rate  Internet_Users
0       10.244         78.9000
2       45.985         19.1000
4       11.044         88.0000
6       13.308         41.9000
8       13.200         83.0000
10      18.300         58.7000
12      11.200         82.1702
14      40.551          9.1000
16       9.200         53.0615
18      15.339         72.0000
20      12.500         54.1700

<br><br>

### Basic Operations with a DataFrame

#### Mathematical Operations:

In [49]:
data.columns

Index(['Country_Name', 'Country_Code', 'Birth_Rate', 'Internet_Users',
       'Income_Group'],
      dtype='object')

In [53]:
result = data["Birth_Rate"] * data["Internet_Users"]
print(result.head())

0    808.2516
1    207.9927
2    878.3135
3    736.5644
4    971.8720
dtype: float64

#### Add Column in DataFrame:

In [66]:
data["MyCalc"] = result
print("\nName of Columns")
print(data.columns)
print("\nDataSets")
print(data.head())

Name of Columns
Index(['Country_Name', 'Country_Code', 'Birth_Rate', 'Internet_Users',
       'Income_Group', 'MyCalc'],
      dtype='object')

DataSets
           Country_Name Country_Code  Birth_Rate  Internet_Users  \
0                 Aruba          ABW      10.244            78.9
1           Afghanistan          AFG      35.253             5.9
2                Angola          AGO      45.985            19.1
3               Albania          ALB      12.877            57.2
4  United Arab Emirates          ARE      11.044            88.0

          Income_Group    MyCalc
0          High income  808.2516
1           Low income  207.9927
2  Upper middle income  878.3135
3  Upper middle income  736.5644
4          High income  971.8720

<br>

#### Removing Columns from DataFrame:

In [67]:
data = data.drop("MyCalc", axis=1) #Here we drop and overwrite data with data variable name.
data.columns

Index(['Country_Name', 'Country_Code', 'Birth_Rate', 'Internet_Users',
       'Income_Group'],
      dtype='object')

<br><br>

### Filtering DataFrames:
- Filtering dataframes helps to find about the insights.
- Filtering is about Rows. We do filtering 90% of time with rows.

#### 1. Let's see example. Finding out `Internet_Users` less than 2

In [88]:
filter1 = data["Internet_Users"] < 2
print(filter1)
mask = filter1
print(data[mask].head())

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: Internet_Users, Length: 195, dtype: bool
    Country_Name Country_Code  Birth_Rate  Internet_Users         Income_Group
11       Burundi          BDI      44.151             1.3           Low income
52       Eritrea          ERI      34.800             0.9           Low income
55      Ethiopia          ETH      32.925             1.9           Low income
64        Guinea          GIN      37.337             1.6           Low income
117      Myanmar          MMR      18.119             1.6  Lower middle income

#### 2. Filtering with multiple data.columns

In [89]:
# Doing two filtering using one code:
filter2= data[data.Birth_Rate > 40 and data.Internet_Users >20]  
# In R this would run properly but not here why?
# In pandas of python we need to use bitwise operators('&', '|' '~') for 'and', 'or', and 'not'.

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [90]:
filter2 = data[(data["Birth_Rate"]>30) & (data["Internet_Users"]>10)]
print(filter2)
print("\nNumber of datas")
print(len(filter2))
print("\nDimension")
print(filter2.ndim)

              Country_Name Country_Code  Birth_Rate  Internet_Users  \
2                   Angola          AGO      45.985            19.1
63                   Ghana          GHA      33.131            12.3
65             Gambia, The          GMB      42.525            14.0
67       Equatorial Guinea          GNQ      35.362            16.4
91                   Kenya          KEN      35.194            39.0
128                Nigeria          NGA      40.045            38.0
150                  Sudan          SDN      33.477            22.7
151                Senegal          SEN      38.533            13.1
158            South Sudan          SSD      37.126            14.1
159  Sao Tome and Principe          STP      34.537            23.0
164              Swaziland          SWZ      30.093            24.7
170             Tajikistan          TJK      30.792            16.0
178                 Uganda          UGA      43.474            16.2
188     West Bank and Gaza          PSE      30.394            46.6
190            Yemen, Rep.          YEM      32.947            20.0
193                 Zambia          ZMB      40.471            15.4
194               Zimbabwe          ZWE      35.715            18.5

            Income_Group
2    Upper middle income
63   Lower middle income
65            Low income
67           High income
91   Lower middle income
128  Lower middle income
150  Lower middle income
151  Lower middle income
158           Low income
159  Lower middle income
164  Lower middle income
170  Lower middle income
178           Low income
188  Lower middle income
190  Lower middle income
193  Lower middle income
194           Low income

Number of datas
17

Dimension
2

#### 3. Filter `string<class>`

In [92]:
# How to filter string class groups.
filter3 = data[data.Income_Group == "High income"]
print(filter3.head())

           Country_Name Country_Code  Birth_Rate  Internet_Users Income_Group
0                 Aruba          ABW      10.244            78.9  High income
4  United Arab Emirates          ARE      11.044            88.0  High income
5             Argentina          ARG      17.716            59.9  High income
7   Antigua and Barbuda          ATG      16.447            63.4  High income
8             Australia          AUS      13.200            83.0  High income

In [99]:
filter4 = data[(data.Income_Group == "High income") & (data.Internet_Users > 70) & (data["Birth_Rate"] < 18)]
print(filter4.head())
print("\nNumber of datas")
print(len(filter4))

            Country_Name Country_Code  Birth_Rate  Internet_Users Income_Group
0                  Aruba          ABW      10.244         78.9000  High income
4   United Arab Emirates          ARE      11.044         88.0000  High income
8              Australia          AUS      13.200         83.0000  High income
9                Austria          AUT       9.400         80.6188  High income
12               Belgium          BEL      11.200         82.1702  High income

Number of datas
39

In [101]:
# How do we get what are the unique categories inside any string series of dataframe.
data.Income_Group.unique() #It shows what different category inside Income Group

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

In [103]:
# How do we find a row or data of a certain country.
print(data[data.Country_Name == "Malta"])

    Country_Name Country_Code  Birth_Rate  Internet_Users Income_Group
116        Malta          MLT         9.5         68.9138  High income

<br><br>

### Accessing Individual Elements
Use of `.at[]` and `.iat[]`

- In `matrices` we can get individal element using slicing .For e.g, data[2,2]
- In `pandas` it shows error
- It is because `pandas` is trying to intepret [2,2] as label-based index lookup, but it cannot find a row or column with the label(2,2)

#### What is `DataFrame.at[]`? 
- Access a single value for a row/column pair by label.
- Answer: `.at[]` is not built-in function like list, tuples, strings. It is used to access specific value in DataFrame, which is `2D labeled data` structure. `.at[]` looks at `label` not `integers`.

In [153]:
data.head()

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [154]:
## Getting element 11.044?
data.at[4, "Birth_Rate"]

11.044

In [155]:
## Setting element 11.044 = 12
data.at[4, "Birth_Rate"] = 12

In [156]:
# Data after setiing BirthRate 12

data.head()

,Country_Name,Country_Code,Birth_Rate,Internet_Users,Income_Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,12.000,88.0,High income

<br>

#### What is `DataFrame.iat[]`?
- Access a single value for a row/column pair by integer position.
- It is used to access scalat vlaue in a DataFrame by integer location.

In [157]:
## Example:
data.iat[2,0]

'Angola'

In [158]:
data.iat[10,0]

'Azerbaijan'

In [159]:
subset = data[::10]
subset.at[50, "Country_Name"] #Which is at 11th row of dataframe.

'Ecuador'

<br>

#### What id `DataFrame.iloc[]`?
- Access group of rows and columns by integer position(s).
- `.iloc[]` is primarily integer position based (from `0` to `length-1` of the axis), but may also be used with a boolean array.

In [164]:
# Indexing just the rows
data.iloc[0:2].head()

  Country_Name Country_Code  Birth_Rate  Internet_Users Income_Group
0        Aruba          ABW      10.244            78.9  High income
1  Afghanistan          AFG      35.253             5.9   Low income